"""
2.4. heapq: Алгоритм сортировки кучи
Двоич. куча может быть предстваленна списком или массивом таким образом,
что дочерние узлы элемента N находятся в позициях 2*N+1 и 2*N+2

min-heap - Куча в которой гарантируется, что значение в любом род. узле не может быть меньшим,
           чем знач. в любои из двух его доч. узлов.

max-heap - Куча в которой гарантируется, что значение в любом род. узле не может быть большим,
           чем знач. в любои из двух его доч. узлов.

Модуль heapq в Python реализует min-heap кучу.
"""
